# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [8]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [9]:
# Create 3 Series with random numbers
s1 = pd.Series(np.random.randint(1, 5, size=100))  # Random numbers from 1 to 4
s2 = pd.Series(np.random.randint(1, 4, size=100))  # Random numbers from 1 to 3
s3 = pd.Series(np.random.randint(10000, 30001, size=100))  # Random numbers from 10,000 to 30,000

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
# Create DataFrame by joining the Series by column
housing_df = pd.concat([s1, s2, s3], axis=1)
housing_df.head()

   0  1      2
0  3  1  21560
1  3  1  11122
2  1  1  19103
3  2  2  24152
4  2  1  14993

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
# Change column names
housing_df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
housing_df.head()

   bedrs  bathrs  price_sqr_meter
0      3       1            21560
1      3       1            11122
2      1       1            19103
3      2       2            24152
4      2       1            14993

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [12]:
# Create one column DataFrame with all values from the 3 Series
bigcolumn = pd.DataFrame(pd.concat([s1, s2, s3], ignore_index=True))
bigcolumn

         0
0        3
1        3
2        1
3        2
4        2
..     ...
295  11853
296  20470
297  15943
298  14234
299  22778

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [13]:
# Check the length of bigcolumn
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [14]:
# Reindex the DataFrame to go from 0 to 299
bigcolumn = bigcolumn.reindex(range(300))
bigcolumn

         0
0        3
1        3
2        1
3        2
4        2
..     ...
295  11853
296  20470
297  15943
298  14234
299  22778

[300 rows x 1 columns]